app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "i like food too!"], ["user_id", 2], ["post_id", 22], ["created_at", 2017-02-28 20:42:26 UTC], ["updated_at", 2017-02-28 20:42:26 UTC]]
---
  def create
    @comment = @post.comments.create(params[:comment].permit(:content))

UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "hello sir"], ["updated_at", 2017-02-28 23:35:27 UTC], ["id", 15]]
---
  def update
    if @comment.update(params[:comment].permit(:content))

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 26], ["id", 15], ["LIMIT", 1]]
---
  def find_comment
    @comment = @post.comments.find(params[:id])