app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY updated_at DESC

  def show
    @post = Post.find(params[:id])
    @comments = Comment.where(post_id: @post).order("created_at DESC")
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 21 ORDER BY created_at DESC

  def create
    @post = current_user.posts.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "dsads"], ["content", "dsadsa"], ["user_id", 1], ["created_at", 2017-02-28 02:12:05 UTC], ["updated_at", 2017-02-28 02:12:05 UTC]]

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Rainy day"], ["content", "its was a long rainy day"], ["updated_at", 2017-02-28 02:15:40 UTC], ["id", 1]]