app/controllers/sessions_controller.rb

 def create
   user = User.find_by(email: params[:login][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ovan20081@outlook.com"], ["LIMIT", 1]]